In [1]:
import pandas as pd
import numpy as np

In [2]:
arr = [1, 2, 3, 4, 5]
s = pd.Series(arr, dtype = int)
s

0    1
1    2
2    3
3    4
4    5
dtype: int32

In [3]:
arr = [1, 2, 3, 4, 5]
s1 = pd.Series(arr, index = ['a', 'b', 'c', 'd', 'e'])
s1

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [4]:
info = {'BMW' : 2024,
        'Lamborghini' : 2023,
        'Ferrari' : 2002}
data = pd.Series(info)
data

BMW            2024
Lamborghini    2023
Ferrari        2002
dtype: int64

In [5]:
data['BMW']

2024

In [6]:
s*3

0     3
1     6
2     9
3    12
4    15
dtype: int32

In [7]:
data = {'Math' : 90,
        'Science' : 88,
        'English' : 95}

db = pd.Series(data)
db

Math       90
Science    88
English    95
dtype: int64

In [8]:
db[db < 90]

Science    88
dtype: int64

In [9]:
data1 = {'Name' : ['Aizen', 'Yamanoto', 'Ichigo'],
         'Age' : [25, 60, 25],
         'City' : ['Espada', 'Soul Soceity', 'Midworld']}
df0 = pd.DataFrame(data1)
df0

       Name  Age          City
0     Aizen   25        Espada
1  Yamanoto   60  Soul Soceity
2    Ichigo   25      Midworld

In [10]:
data = [['Alice', 25, 'New York'],
        ['Bob', 30, 'Los Angeles'],
        ['Charlie', 35, 'Chicago']]
df = pd.DataFrame(data,
                  columns = ['Name','Age','City'],
                  index = ['a','b','c'])
df

      Name  Age         City
a    Alice   25     New York
b      Bob   30  Los Angeles
c  Charlie   35      Chicago

In [11]:
data = pd.read_csv('test.csv')
data

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3
0,1000004,P00128942,M,46-50,7,B,2,1,1,11.0,NaN
1,1000009,P00113442,M,26-35,17,C,0,0,3,5.0,NaN
2,1000010,P00288442,F,36-45,1,B,4+,1,5,14.0,NaN
3,1000010,P00145342,F,36-45,1,B,4+,1,4,9.0,NaN
4,1000011,P00053842,F,26-35,1,C,1,0,4,5.0,12.0
...,...,...,...,...,...,...,...,...,...,...,...
233594,1006036,P00118942,F,26-35,15,B,4+,1,8,NaN,NaN
233595,1006036,P00254642,F,26-35,15,B,4+,1,5,8.0,NaN
233596,1006036,P00031842,F,26-35,15,B,4+,1,1,5.0,12.0
233597,1006037,P00124742,F,46-50,1,C,4+,0,10,16.0,NaN
233598,1006039,P00316642,F,46-50,0,B,4+,1,4,5.0,NaN

In [12]:
data.shape

(233599, 11)

In [13]:
type(data)

pandas.core.frame.DataFrame

In [14]:
data.head()

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3
0,1000004,P00128942,M,46-50,7,B,2,1,1,11.0,NaN
1,1000009,P00113442,M,26-35,17,C,0,0,3,5.0,NaN
2,1000010,P00288442,F,36-45,1,B,4+,1,5,14.0,NaN
3,1000010,P00145342,F,36-45,1,B,4+,1,4,9.0,NaN
4,1000011,P00053842,F,26-35,1,C,1,0,4,5.0,12.0

In [15]:
data.tail()

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3
233594,1006036,P00118942,F,26-35,15,B,4+,1,8,NaN,NaN
233595,1006036,P00254642,F,26-35,15,B,4+,1,5,8.0,NaN
233596,1006036,P00031842,F,26-35,15,B,4+,1,1,5.0,12.0
233597,1006037,P00124742,F,46-50,1,C,4+,0,10,16.0,NaN
233598,1006039,P00316642,F,46-50,0,B,4+,1,4,5.0,NaN

In [16]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 233599 entries, 0 to 233598
Data columns (total 11 columns):
 #   Column                      Non-Null Count   Dtype
---  ------                      --------------   -----
 0   User_ID                     233599 non-null  int64
 1   Product_ID                  233599 non-null  object
 2   Gender                      233599 non-null  object
 3   Age                         233599 non-null  object
 4   Occupation                  233599 non-null  int64
 5   City_Category               233599 non-null  object
 6   Stay_In_Current_City_Years  233599 non-null  object
 7   Marital_Status              233599 non-null  int64
 8   Product_Category_1          233599 non-null  int64
 9   Product_Category_2          161255 non-null  float64
 10  Product_Category_3          71037 non-null   float64
dtypes: float64(2), int64(4), object(5)
memory usage: 19.6+ MB

In [17]:
data.isnull().sum()

User_ID                            0
Product_ID                         0
Gender                             0
Age                                0
Occupation                         0
City_Category                      0
Stay_In_Current_City_Years         0
Marital_Status                     0
Product_Category_1                 0
Product_Category_2             72344
Product_Category_3            162562
dtype: int64

In [18]:
pd.isna(data['Gender'])

0         False
1         False
2         False
3         False
4         False
          ...
233594    False
233595    False
233596    False
233597    False
233598    False
Name: Gender, Length: 233599, dtype: bool

In [20]:
data.isna().sum()

User_ID                            0
Product_ID                         0
Gender                             0
Age                                0
Occupation                         0
City_Category                      0
Stay_In_Current_City_Years         0
Marital_Status                     0
Product_Category_1                 0
Product_Category_2             72344
Product_Category_3            162562
dtype: int64

In [21]:
data['Product_Category_2'].notna()

0          True
1          True
2          True
3          True
4          True
          ...
233594    False
233595     True
233596     True
233597     True
233598     True
Name: Product_Category_2, Length: 233599, dtype: bool

In [23]:
data.describe()

,User_ID,Occupation,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3
count,2.335990e+05,233599.000000,233599.000000,233599.000000,161255.000000,71037.000000
mean,1.003029e+06,8.085407,0.410070,5.276542,9.849586,12.669454
std,1.726505e+03,6.521146,0.491847,3.736380,5.094943,4.125944
min,1.000001e+06,0.000000,0.000000,1.000000,2.000000,3.000000
25%,1.001527e+06,2.000000,0.000000,1.000000,5.000000,9.000000
50%,1.003070e+06,7.000000,0.000000,5.000000,9.000000,14.000000
75%,1.004477e+06,14.000000,1.000000,8.000000,15.000000,16.000000
max,1.006040e+06,20.000000,1.000000,18.000000,18.000000,18.000000

In [24]:
data.columns

Index(['User_ID', 'Product_ID', 'Gender', 'Age', 'Occupation', 'City_Category',
       'Stay_In_Current_City_Years', 'Marital_Status', 'Product_Category_1',
       'Product_Category_2', 'Product_Category_3'],
      dtype='object')

In [25]:
data.dtypes

User_ID                         int64
Product_ID                     object
Gender                         object
Age                            object
Occupation                      int64
City_Category                  object
Stay_In_Current_City_Years     object
Marital_Status                  int64
Product_Category_1              int64
Product_Category_2            float64
Product_Category_3            float64
dtype: object

In [26]:
data['Gender'].value_counts()

Gender
M    175772
F     57827
Name: count, dtype: int64

In [27]:
data['Marital_Status'].value_counts()

Marital_Status
0    137807
1     95792
Name: count, dtype: int64

In [28]:
data2 = pd.read_excel('Sales_Data_Analysis.xlsx')
data2

,Date,Product Name,Category,Sales Quantity,Unit Price,Total Sales,Region,Salesperson
0,2024-04-24,Smartphone,Electronics,3,369.55,1108.65,East,Bob
1,2024-01-16,Fiction,Books,2,113.23,226.46,West,Alice
2,2024-04-11,Science,Books,9,212.66,1913.94,North,Eleanor
3,2024-03-22,Doll,Toys,7,173.42,1213.94,East,Alice
4,2024-02-17,Jeans,Clothing,7,52.87,370.09,East,Alice
...,...,...,...,...,...,...,...,...
195,2024-12-07,Tablet,Electronics,5,27.48,137.40,West,Eleanor
196,2024-04-14,Doll,Toys,5,472.94,2364.70,North,Alice
197,2024-03-02,Jacket,Clothing,1,251.21,251.21,East,Catherine
198,2024-09-29,Action Figure,Toys,4,252.63,1010.52,South,David
199,2024-08-11,Microwave,Home Appliances,1,232.58,232.58,West,Alice

In [29]:
data2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 8 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Date            200 non-null    datetime64[ns]
 1   Product Name    200 non-null    object
 2   Category        200 non-null    object
 3   Sales Quantity  200 non-null    int64
 4   Unit Price      200 non-null    float64
 5   Total Sales     200 non-null    float64
 6   Region          200 non-null    object
 7   Salesperson     200 non-null    object
dtypes: datetime64[ns](1), float64(2), int64(1), object(4)
memory usage: 12.6+ KB

In [32]:
data2.shape

(200, 8)

In [31]:
data2.describe()

                      Date  Sales Quantity  Unit Price  Total Sales
count                  200      200.000000  200.000000   200.000000
mean   2024-06-26 02:31:12        5.425000  250.086600  1330.496550
min    2024-01-02 00:00:00        1.000000    6.610000     6.760000
25%    2024-03-21 18:00:00        3.000000  134.705000   430.050000
50%    2024-06-20 12:00:00        5.000000  251.455000  1096.905000
75%    2024-10-05 12:00:00        8.000000  373.150000  1897.425000
max    2024-12-27 00:00:00       10.000000  498.080000  4980.800000
std                    NaN        2.827428  141.439554  1114.824533

In [34]:
data2.isnull().sum()

Date              0
Product Name      0
Category          0
Sales Quantity    0
Unit Price        0
Total Sales       0
Region            0
Salesperson       0
dtype: int64

In [35]:
data2.isna()

,Date,Product Name,Category,Sales Quantity,Unit Price,Total Sales,Region,Salesperson
0,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...
195,False,False,False,False,False,False,False,False
196,False,False,False,False,False,False,False,False
197,False,False,False,False,False,False,False,False
198,False,False,False,False,False,False,False,False
199,False,False,False,False,False,False,False,False

In [36]:
data2.head()

,Date,Product Name,Category,Sales Quantity,Unit Price,Total Sales,Region,Salesperson
0,2024-04-24,Smartphone,Electronics,3,369.55,1108.65,East,Bob
1,2024-01-16,Fiction,Books,2,113.23,226.46,West,Alice
2,2024-04-11,Science,Books,9,212.66,1913.94,North,Eleanor
3,2024-03-22,Doll,Toys,7,173.42,1213.94,East,Alice
4,2024-02-17,Jeans,Clothing,7,52.87,370.09,East,Alice

In [37]:
data2.tail()

,Date,Product Name,Category,Sales Quantity,Unit Price,Total Sales,Region,Salesperson
195,2024-12-07,Tablet,Electronics,5,27.48,137.40,West,Eleanor
196,2024-04-14,Doll,Toys,5,472.94,2364.70,North,Alice
197,2024-03-02,Jacket,Clothing,1,251.21,251.21,East,Catherine
198,2024-09-29,Action Figure,Toys,4,252.63,1010.52,South,David
199,2024-08-11,Microwave,Home Appliances,1,232.58,232.58,West,Alice

In [38]:
data2.columns

Index(['Date', 'Product Name', 'Category', 'Sales Quantity', 'Unit Price',
       'Total Sales', 'Region', 'Salesperson'],
      dtype='object')

In [39]:
data2.dtypes

Date              datetime64[ns]
Product Name              object
Category                  object
Sales Quantity             int64
Unit Price               float64
Total Sales              float64
Region                    object
Salesperson               object
dtype: object

In [40]:
data2['Region'].value_counts()

Region
East     57
North    56
West     50
South    37
Name: count, dtype: int64

In [41]:
data2[['Region', 'Salesperson', 'Total Sales']]

    Region Salesperson  Total Sales
0     East         Bob      1108.65
1     West       Alice       226.46
2    North     Eleanor      1913.94
3     East       Alice      1213.94
4     East       Alice       370.09
..     ...         ...          ...
195   West     Eleanor       137.40
196  North       Alice      2364.70
197   East   Catherine       251.21
198  South       David      1010.52
199   West       Alice       232.58

[200 rows x 3 columns]

In [42]:
data2.loc[5, 'Category']

'Home Appliances'

In [43]:
data2.columns

Index(['Date', 'Product Name', 'Category', 'Sales Quantity', 'Unit Price',
       'Total Sales', 'Region', 'Salesperson'],
      dtype='object')

In [45]:
data2.loc[3]

Date              2024-03-22 00:00:00
Product Name                     Doll
Category                         Toys
Sales Quantity                      7
Unit Price                     173.42
Total Sales                   1213.94
Region                           East
Salesperson                     Alice
Name: 3, dtype: object

In [46]:
data2.loc[[0, 2], ['Product Name', 'Sales Quantity']]

  Product Name  Sales Quantity
0   Smartphone               3
2      Science               9

In [47]:
data2.iloc[1, 4]

113.23

In [48]:
data2.loc[1, 'Unit Price']

113.23

In [49]:
max_salary = data2['Total Sales'].max()
max_salary

4980.8

In [50]:
max_salary2 = data2[data2['Total Sales'] == max_salary]
max_salary2

,Date,Product Name,Category,Sales Quantity,Unit Price,Total Sales,Region,Salesperson
15,2024-07-14,Shoes,Clothing,10,498.08,4980.8,North,David

In [52]:
specific_rows = data2[data2['Unit Price'] < 250]
specific_rows

,Date,Product Name,Category,Sales Quantity,Unit Price,Total Sales,Region,Salesperson
1,2024-01-16,Fiction,Books,2,113.23,226.46,West,Alice
2,2024-04-11,Science,Books,9,212.66,1913.94,North,Eleanor
3,2024-03-22,Doll,Toys,7,173.42,1213.94,East,Alice
4,2024-02-17,Jeans,Clothing,7,52.87,370.09,East,Alice
5,2024-08-23,Air Conditioner,Home Appliances,9,66.79,601.11,East,Alice
...,...,...,...,...,...,...,...,...
191,2024-08-20,Non-fiction,Books,6,82.92,497.52,West,David
193,2024-12-04,Smartphone,Electronics,7,245.40,1717.80,East,David
194,2024-09-19,Board Game,Toys,2,175.86,351.72,East,Bob
195,2024-12-07,Tablet,Electronics,5,27.48,137.40,West,Eleanor
199,2024-08-11,Microwave,Home Appliances,1,232.58,232.58,West,Alice

In [53]:
s2 = data2.query("Region == 'West'")
s2

,Date,Product Name,Category,Sales Quantity,Unit Price,Total Sales,Region,Salesperson
1,2024-01-16,Fiction,Books,2,113.23,226.46,West,Alice
8,2024-03-24,Puzzle,Toys,6,180.86,1085.16,West,Catherine
12,2024-11-25,Refrigerator,Home Appliances,8,75.72,605.76,West,David
14,2024-01-25,Jeans,Clothing,2,80.66,161.32,West,Alice
23,2024-10-03,Jacket,Clothing,4,357.91,1431.64,West,Bob
24,2024-08-19,Puzzle,Toys,2,127.71,255.42,West,Eleanor
28,2024-08-30,Dress,Clothing,7,99.25,694.75,West,Bob
31,2024-08-04,Dress,Clothing,3,142.88,428.64,West,Bob
32,2024-02-20,T-shirt,Clothing,1,327.81,327.81,West,Eleanor
39,2024-10-18,Laptop,Electronics,4,291.56,1166.24,West,Alice
63,2024-10-10,Puzzle,Toys,3,99.96,299.88,West,Catherine
69,2024-04-09,Headphones,Electronics,7,249.72,1748.04,West,Eleanor
74,2024-05-20,Air Conditioner,Home Appliances,8,43.35,346.80,West,Bob
76,2024-12-27,Jeans,Clothing,4,36.79,147.16,West,Bob
77,2024-02-01,Puzzle,Toys,4,417.28,1669.12,West,David
79,2024-10-02,Vacuum Cleaner,Home Appliances,9,400.93,3608.37,West,David
84,2024-08-03,Vacuum Cleaner,Home Appliances,5,418.28,2091.40,West,Catherine
89,2024-04-11,Air Conditioner,Home Appliances,2,298.09,596.18,West,David
91,2024-02-05,Air Conditioner,Home Appliances,9,325.53,2929.77,West,Catherine
92,2024-08-09,Headphones,Electronics,6,319.61,1917.66,West,Alice
93,2024-09-24,Action Figure,Toys,5,309.88,1549.40,West,Bob
94,2024-10-30,Biography,Books,5,164.54,822.70,West,David
99,2024-01-09,Shoes,Clothing,2,150.65,301.30,West,David
108,2024-02-03,Tablet,Electronics,7,248.41,1738.87,West,Alice
110,2024-11-01,T-shirt,Clothing,10,116.72,1167.20,West,Eleanor
111,2024-06-01,Biography,Books,10,495.07,4950.70,West,David
114,2024-08-28,Headphones,Electronics,5,21.16,105.80,West,Eleanor
115,2024-12-17,Vacuum Cleaner,Home Appliances,4,462.34,1849.36,West,Alice
116,2024-10-05,Non-fiction,Books,4,325.58,1302.32,West,Alice
118,2024-08-27,Comics,Books,5,351.37,1756.85,West,Alice
119,2024-02-11,Air Conditioner,Home Appliances,10,24.73,247.30,West,David
122,2024-04-02,Shoes,Clothing,10,220.76,2207.60,West,Catherine
123,2024-07-28,Lego Set,Toys,6,163.92,983.52,West,Catherine
127,2024-01-27,Comics,Books,4,137.19,548.76,West,David
128,2024-03-03,Jacket,Clothing,1,486.71,486.71,West,David
132,2024-11-02,Non-fiction,Books,9,374.41,3369.69,West,Bob
135,2024-06-19,Doll,Toys,9,382.62,3443.58,West,Catherine
150,2024-02-24,Refrigerator,Home Appliances,4,193.78,775.12,West,David
152,2024-04-27,Fiction,Books,10,401.96,4019.60,West,Catherine
154,2024-10-23,Tablet,Electronics,6,367.52,2205.12,West,Alice
164,2024-03-20,Air Conditioner,Home Appliances,7,329.19,2304.33,West,Eleanor
165,2024-01-17,Doll,Toys,6,112.55,675.30,West,Catherine
167,2024-04-07,Microwave,Home Appliances,2,474.76,949.52,West,Catherine
176,2024-09-08,Board Game,Toys,8,41.38,331.04,West,Alice
179,2024-12-25,Science,Books,2,427.13,854.26,West,Alice
180,2024-04-26,Non-fiction,Books,7,172.77,1209.39,West,David
181,2024-06-09,Board Game,Toys,7,159.70,1117.90,West,Alice
191,2024-08-20,Non-fiction,Books,6,82.92,497.52,West,David
195,2024-12-07,Tablet,Electronics,5,27.48,137.40,West,Eleanor
199,2024-08-11,Microwave,Home Appliances,1,232.58,232.58,West,Alice